       IDENTIFICATION DIVISION.
       PROGRAM-ID.     EVAL01.
       DATA DIVISION.
       WORKING-STORAGE SECTION. 
       01  STUDENT-NAME               PIC X(20).
       01  STUDENT-MAARK-1            PIC 999.
       01  STUDENT-MAARK-2            PIC 999.
       PROCEDURE DIVISION.
           DISPLAY 'ENTER STUDENT DETAIL'
           ACCEPT STUDENT-NAME
           ACCEPT STUDENT-MAARK-1
           ACCEPT STUDENT-MAARK-2
           EVALUATE (STUDENT-MAARK-1 + STUDENT-MAARK-2) / 2
              WHEN 40 THRU 49.9 DISPLAY 'THIRD CLASS'
              WHEN 50 THRU 59.9 DISPLAY 'LOWER SECOND'
              WHEN 60 THRU 69.9 DISPLAY 'UPPER SECOND'
              WHEN 70 THRU 100  DISPLAY 'FIRST CLASS'
              WHEN OTHER        DISPLAY 'PROG OR DATA ERROR!'
           END-EVALUATE.
           GOBACK.
