       IDENTIFICATION DIVISION.
       PROGRAM-ID.     CONCAT01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           GOBACK.

           