       IDENTIFICATION DIVISION.
       PROGRAM-ID.        EDIT01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  STARTNUM    PIC 9(8)V99 VALUE 00001123.55.  
       01  NOZERO      PIC ZZZZZZZ9.99.
       PROCEDURE DIVISION.
           GOBACK.