       IDENTIFICATION DIVISION.
       PROGRAM-ID.     FLOAT01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PRICE     PIC 9(4)V99.
       01 TAXRATE   PIC   V999 VALUE .075.
       01 FULLPRICE PIC 9(4)V99.
       PROCEDURE DIVISION.
           DISPLAY 'ENTER THE PRICE: ' WITH NO ADVANCING
           ACCEPT PRICE
           COMPUTE FULLPRICE ROUNDED = PRICE + (PRICE * TAXRATE)
           DISPLAY 'PRICE + TAX: ' FULLPRICE
           GOBACK.
