       IDENTIFICATION DIVISION.
       PROGRAM-ID.     OPERA.
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 WS-NUM1         PIC 99 VALUE 10.
       01 WS-NUM2         PIC 99 VALUE 65.
       01 WS-RESUL        PIC 99 VALUE ZEROES.
       PROCEDURE DIVISION.
       
           GOBACK.
