       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SORT01.
       ENVIRONMENT DIVISION. 
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM SORT01.